// ~~~~~~~~~~~~~~~~~~~~~~ \\
// Mobile Handling Config \\
// ~~~~~~~~~~~~~~~~~~~~~~ \\

///////////////////////////////////////////////////////////////////
/////////////////////// Mobile Handling ///////////////////////////
///////////////////////////////////////////////////////////////////

// Lottie Constants
export const lottieConfigPath = "./src/json/rotate-phone.json";
export const lottieRenderer = "svg";

// Platforms
export const iOS = "iOS";
export const Android = "Android";
export const Windows = "Windows";
export const macOS = "macOS";
export const unknownPlatform = "Unknown Platform";

// Install Dialog
export const installDialogTexts = {
	[Android]: {
		title: "הורדה אנדרואיד",
		text: null,
		display: true,
	},
	[iOS]: {
		title: "הורדה iOS",
		text: '<h3><u>הוראות התקנה</u>:</h3><b>1.</b> יש לפתוח את האתר <b>בדפדפן ספארי בלבד!</b><br><b>2.</b> לחצו על כפתור ההורדה בתחתית האתר.<br><b>3.</b> אשרו את ההודעה הקופצת בשביל לאפשר את ההורדה של קובץ ההתקנה (פרופיל).<br><b>4.</b> לאחר אישורכם, תופיע הודעת אישור שתפנה אתכם לאפליקציית <b>"הגדרות"</b>.<br><b>5.</b> במסך הראשי אמור להופיע לכם כפתור שמצביע על הפרופיל שהורדתם - לחיצה עליו תפתח מסך להתקנת הפרופיל. (במידה ואתם לא מזהים כפתור כזה, לכו ל<b>"כללי" -> "ניהול מכשירים ו-VPN"</b>, ולחצו על הפרופיל שנקרא <b>SECHEMETER</b>).<br><b>6.</b> התקינו את הפרופיל (כפתור בפינת המסך).<br><b>7.</b> ייתכן ותתבקשו להזין את קוד הגישה שלכם - <u>זה תקין וכחלק ממנגנון הגנה של אפל</u>.<br><b>8.</b> יפתח לכם מסך עם משפט מוטיבציה נחמד לתהליך הקבלה 😄<br><b>9.</b> אחרי שנהנתם מהמשפט, לחצו <b>"הבא"</b> ואז אשרו את ההתקנה.<br><b>10.</b> כעת תוכלו למצוא את האפליקציה במסך הבית 💪',
		display: true,
	},
	[Windows]: {
		title: "הורדה Windows",
		text: '<h3><u>הוראות התקנה</u>:</h3><b>1.</b> יש לפתוח את האתר בדפדפן לבחירתכם.<br><b>2.</b> <b>שימו לב!</b> ניסיון הורדה מחלון <b>"גלישה בסתר"</b>, צפוי להיכשל.<br><b>3.</b> לחצו על כפתור ההורדה בתחתית האתר.<br><b>4.</b> אשרו את ההודעה הקופצת בשביל לאפשר את ההורדה של האתר כאפליקציה.<br><b>5.</b> כעת תוכלו למצוא את האפליקציה במסך הבית 💪',
		display: true,
	},
};
